app/controllers/api/blogs_controller.rb

    def create
        @blog = Blog.new(blog_params)
        @blog.author_id = current_user.id

        if @blog.save
---
INSERT INTO "blogs" ("title", "description", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

    def destroy
        @blog = Blog.find(params[:id])
        @blog.destroy
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
DELETE FROM "blogs" WHERE "blogs"."id" = $1  [["id", 13]]

    def index
        @blogs = Blog.all.includes(:user)
---
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2, $3)  [["id", 2], ["id", 3], ["id", 17]]
SELECT "blogs".* FROM "blogs"