app/controllers/api/posts_controller.rb

    def create
        @post = Post.new(post_params)
        # @post.author_id = current_user.id

        if @post.save
---
INSERT INTO "posts" ("title", "text", "pic_url", "blog_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "New Post"], ["text", ""], ["pic_url", ""], ["blog_id", 27], ["created_at", "2020-03-21 19:25:07.688879"], ["updated_at", "2020-03-21 19:25:07.688879"]]

    def index
        # @posts = Post.all.includes(:user)
        @posts = Post.all
---
SELECT "posts".* FROM "posts"