app/controllers/api/users_controller.rb

    def show
        # prevents n+1 ?
        @user = User.find(params[:id]).includes(:follows)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]