app/controllers/application_controller.rb

    def current_user
        @current_user ||= User.find_by_session_token(self.session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "nnJH9uHR2q8_B7BglzHRTg"], ["LIMIT", 1]]